src/DataProcessors/ОткрытиеЗакрытиеСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОткрытиеЗакрытиеСмены</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокОткрытияСмены</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивБригад</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивУдаленных</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборПрав</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыПравДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пейджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Comment>полностью, кратко в наименовании</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Comment>Код ручного доступа сотрудника к системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригадир</Name>
					<Comment>является бригадиром</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>для идентификации сотрудника как клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПланЗала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БригадыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Comment>является курьером доставки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пейджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветОповещенияГотовности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УР_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставБригады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПраваДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоРеализации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборПрав</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыПравДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ОткрытиеЗакрытиеСмены/Forms/ПодборСотрудников/module.bsl
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	// установим отбор по сотрудникам, имеющим права доступа в текущем месте реализации
	СписокСотрудников = Новый СписокЗначений;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка
	                      |ИЗ
	                      |	Справочник.Сотрудники.ПраваДоступа
	                      |ГДЕ
	                      |	НЕ Ссылка.ПометкаУдаления
	                      |	И МестоРеализации = &МестоРеализации
	                      |	И НаборПрав <> ЗНАЧЕНИЕ(Справочник.НаборыПравДоступа.ПустаяСсылка)
						  |");
						  
	Запрос.УстановитьПараметр("МестоРеализации", глПараметрыРМ.МестоРеализации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСотрудников.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Сотрудники.Отбор.Ссылка.Использование	= Истина;
	Сотрудники.Отбор.Ссылка.ВидСравнения	= ВидСравнения.ВСписке;
	Сотрудники.Отбор.Ссылка.Значение		= СписокСотрудников;
	
	Сотрудники.Отбор.ПометкаУдаления.Установить(Ложь);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	глОтсечкаПростоя();
	ТекущийЭлемент = ЭлементыФормы.Сотрудники;
	
	ЭлементыФормы.тЗаголовок.Заголовок = "Выбрано сотрудников: "+Формат(ТаблицаСотрудников.Количество(),"ЧН=");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаВыбратьНажатие(Элемент)
	
	ВыбСотрудник = ЭлементыФормы.Сотрудники.ТекущаяСтрока;
	
	Если ВыбСотрудник.ЭтоГруппа Тогда
		ТекущийРодитель = ВыбСотрудник;
	Иначе
		ОбработкаВыбораСотрудника(ВыбСотрудник);
	КонецЕсли; 
	
КонецПроцедуры

Процедура КнопкаУровеньВверхНажатие(Элемент)
	
	ТекущийЭлемент = ЭлементыФормы.Сотрудники;
	WshShell.SendKeys("^{UP}");
	
КонецПроцедуры

Процедура КнопкаСтрелкаВверхНажатие(Элемент)
	
	ТекущийЭлемент = ЭлементыФормы.Сотрудники;
	WshShell.SendKeys("{UP}");
	
КонецПроцедуры

Процедура КнопкаСтрелкаВнизНажатие(Элемент)
	
	ТекущийЭлемент = ЭлементыФормы.Сотрудники;
	WshShell.SendKeys("{DOWN}");
	
КонецПроцедуры

Процедура КнопкаУровеньВнизНажатие(Элемент)
	
	ТекущийЭлемент = ЭлементыФормы.Сотрудники;
	WshShell.SendKeys("^{DOWN}");
	
КонецПроцедуры

Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если НЕ ВыбраннаяСтрока.ЭтоГруппа Тогда
		СтандартнаяОбработка = Ложь;
		ОбработкаВыбораСотрудника(ВыбраннаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

Процедура СотрудникиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	
	ОформлениеСтроки.Ячейки.Пиктограмма.ОтображатьТекст  = Ложь;
	
	Если ТаблицаСотрудников.Найти(ДанныеСтроки.Ссылка,"Сотрудник") = Неопределено Тогда
		ОформлениеСтроки.Ячейки.Пиктограмма.ОтображатьКартинку = Ложь;
		ОформлениеСтроки.Шрифт = Новый Шрифт(,10,Ложь);			// не жирный
	Иначе
		ОформлениеСтроки.Ячейки.Пиктограмма.ОтображатьКартинку = Истина;
		ОформлениеСтроки.Ячейки.Пиктограмма.ИндексКартинки = 0;
		ОформлениеСтроки.Шрифт = Новый Шрифт(,10,Истина);			// жирный
	КонецЕсли; 
	
	СтрокаТЧПраваДоступа = ДанныеСтроки.Ссылка.ПраваДоступа.Найти(глПараметрыРМ.МестоРеализации, "МестоРеализации");
	
	ОформлениеСтроки.Ячейки.НаборПрав.ОтображатьТекст  = Истина;
	ОформлениеСтроки.Ячейки.НаборПрав.Текст = ?(СтрокаТЧПраваДоступа = Неопределено, "", СтрокаТЧПраваДоступа.НаборПрав.Наименование);
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина,,,,);
